tsung/create_room.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">
	<!-- Client side setup -->
	<clients>
		<client host="localhost" use_controller_vm="true" maxusers='1500'/>
	</clients>
 	<!-- Server side setup -->
	<servers>
		<server host="hyhyh-test.jm8qqevcmb.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
	</servers>
	    <load>
	        <arrivalphase phase="1" duration="30" unit="second">
	                <users arrivalrate="5" unit="second"/>
	        </arrivalphase>

	        <arrivalphase phase="2" duration="30" unit="second">
	                <users arrivalrate="10" unit="second"/>
	        </arrivalphase>
	        <arrivalphase phase="3" duration="30" unit="second">
	                <users arrivalrate="15" unit="second"/>
	        </arrivalphase>
	        <arrivalphase phase="4" duration="30" unit="second">
	                <users arrivalrate="20" unit="second"/>
	        </arrivalphase>
	        <arrivalphase phase="5" duration="30" unit="second">
	                <users arrivalrate="25" unit="second"/>
	        </arrivalphase>
	        <arrivalphase phase="6" duration="30" unit="second">
	                <users arrivalrate="30" unit="second"/>
	        </arrivalphase>
	    </load>
 	<options>
		<option name="global_ack_timeout" value="2000"/>
	</options>


 	<sessions>
		<session name="register-createRoom" weight="1" type="ts_http">

			<setdynvars sourcetype="random_string" length="5">
				<var name="room_name" />
			</setdynvars>

			<setdynvars sourcetype="random_string" length="11">
				<var name="link1" />
				<var name="link2" />
			</setdynvars>

			<setdynvars sourcetype="random_string" length="10">
                <var name="username" />
            </setdynvars>

 			<request subst="true">
				<dyn_variable name="authenticity_token" re='name="authenticity_token" value="(.*)"'></dyn_variable>
				<http url="/signup" version="1.1" method="GET"></http>
			</request>

			<thinktime value="2"></thinktime>

			<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
				{ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
				edoc_lib:escape_uri(binary_to_list(Val)) end.">
				<var name="escaped_authenticity_token" />
			</setdynvars>

 			<!-- Create the random account and get the userid -->
			<request subst="true">
				<dyn_variable name="userid" re="[Ll]ocation: http://.*/users/([0-9]+)"></dyn_variable>
				<http url='/users'
					version='1.1' 
					method='POST' 
					contents='authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Busername%5D=%%_username%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Create+Account'
					content_type="application/x-www-form-urlencoded"/>
			</request>

			<thinktime value="2"></thinktime>
			
      <!-- Go to the profile page -->
      <request subst="true">
              <dyn_variable name="authenticity_token"></dyn_variable>
              <http url="/users/%%_userid%%" version="1.1" method="GET"/>
      </request>
			
			<request subst="true">
        <dyn_variable name="authenticity_token" ></dyn_variable>
        <http url="/rooms/new" version="1.1" method="GET"></http>
      </request>
            
      <thinktime value="2"></thinktime>

			<!-- create room -->
			<request subst="true">
				<dyn_variable name="roomid" re="[Ll]ocation: http://.*/rooms/([0-9]+)"></dyn_variable>
				<http url="/rooms"
					version="1.1"
					method="POST"
					contents="authenticity_token=%%_escaped_authenticity_token%%&amp;room[host_id]=%%_userid%%&amp;room[room_name]=%%_room_name%%&amp;room[link_1]=https://www.youtube.com/watch?v=%%_link1%%&amp;room[link_2]=https://www.youtube.com/watch?v=%%_link2%%&amp;commit=Create+Room"
					content_type="application/x-www-form-urlencoded"/>
			</request>

			<!-- Logout -->
			<!--<request subst="true">-->
			<!--	<http url="/logout" method="DELETE" />-->
			<!--</request>-->
		</session>

		<!-- Register and go to lobby site -->
		<session name="register-lobby-sort" weight="1" type="ts_http">

			<setdynvars sourcetype="random_string" length="10">
				<!-- Randomly generate the username -->
                <var name="username" />
            </setdynvars>

      <request subst="true">
				<dyn_variable name="authenticity_token" re='name="authenticity_token" value="(.*)"'></dyn_variable>
				<http url="/signup" version="1.1" method="GET"></http>
			</request>

			<thinktime value="2"></thinktime>

			<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
				{ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
				edoc_lib:escape_uri(binary_to_list(Val)) end.">
				<var name="escaped_authenticity_token" />
			</setdynvars>

 			<!-- Create the random account and get the userid -->
			<request subst="true">
				<dyn_variable name="userid" re="[Ll]ocation: http://.*/users/([0-9]+)"></dyn_variable>
				<http url='/users'
					version='1.1' 
					method='POST' 
					contents='authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Busername%5D=%%_username%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Create+Account'
					content_type="application/x-www-form-urlencoded"/>
			</request>

			<thinktime value="2"></thinktime>
			
			<!-- Go to the profile page -->
      <request subst="true">
              <dyn_variable name="authenticity_token"></dyn_variable>
              <http url="/users/%%_userid%%" version="1.1" method="GET"/>
      </request>

			<!-- Go to lobby -->
			<request subst="true">
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http url="/rooms" version="1.1" method="GET"/>
			</request>
			
			<!-- lobby recent -->
			<request subst="true">
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http url="/rooms/recent" version="1.1" method="GET"/>
			</request>

			<!-- lobby mostUser -->
			<request subst="true">
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http url="/rooms/mostUser" version="1.1" method="GET"/>
			</request>
			
      <thinktime value="2"></thinktime>
			
			<setdynvars sourcetype= "random_number" start="50" end="150">
        <var name="random_room" />
      </setdynvars>
      
			<request subst="true">
			    <dyn_variable name="roomid" re="[Ll]ocation: http://.*/videorooms/([0-9]+)"></dyn_variable>
			    <http url="/users/%%_userid%%/join"
			                            version="1.1"
			                            method="POST"
			                            contents="authenticity_token=%%_escaped_authenticity_token%%&amp;search=%%_random_room%%&amp;id=%%_userid%%"
			                            content_type="application/x-www-form-urlencoded"/>
			</request>
			
			
			<thinktime value="2"></thinktime>
			<request subst="true">
			    <http url="/users/%%_roomid%%/exit"
			      
			                            version="1.1"
			                            method="POST"
			                            contents="authenticity_token=%%_escaped_authenticity_token%%"
			                            content_type="application/x-www-form-urlencoded"/>
			</request>

			<!-- Logout -->
			<request subst="true">
				<http url="/logout" method="DELETE" />
			</request>
		</session>

	</sessions>
</tsung>